// Лента пользователей
// API

// https://jsonplaceholder.typicode.com/users

// Что нужно сделать
//  Получить данные через fetch
// При загрузке страницы.

// Отрисовать карточки пользователей
// Каждый пользователь должен выглядеть примерно так:

// Leanne Graham
//  Sincere@april.biz
//  Gwenborough
//  Romaguera-Crona
// Поля:
// name
// email
// address.city
// company.name


// Фильтрация
// Добавить кнопку:
// "Только с длинным именем"
// При нажатии:
// показать только пользователей, у которых длина имени > 15 символов.
// При повторном нажатии:
// вернуть всех.


//  Статистика (обязательно)
// Под списком вывести:
// всего пользователей
// сколько отображается сейчас
// сколько скрыто фильтром


// Сортировка
// Добавить кнопку:
// "Сортировать по имени"
// меняет порядок A → Z
// повторное нажатие → Z → A


// Что обязательно использовать
// fetch
// then / catch
// map
// filter
// sort
// работу с DOM
// функции (разделить логику, не писать всё в одном месте)
